#
# Created by 
#   ../bin/Linux-x86_64-O/oasysGui 19.2-p002 on Sat Apr 25 14:46:44 2020
# (C) Mentor Graphics Corporation
#
set_units -time ns -capacitance ff -resistance kohm -power nW -voltage V -current mA
create_clock -period 1.5 -waveform {0 0.75} -name sysclk [get_ports CLK]
create_clock -period 1.5 -waveform {0 0.75} -name vsysclk 
set_false_path -from [get_ports RST]
group_path -name I2R -from [list [get_ports {dataIn[0]}] [get_ports {dataIn[1]}] [get_ports {dataIn[2]}] [get_ports {dataIn[3]}] [get_ports {dataIn[4]}] [get_ports {dataIn[5]}] [get_ports {dataIn[6]}] [get_ports {dataIn[7]}] [get_ports {dataIn[8]}] [get_ports {dataIn[9]}] [get_ports {dataIn[10]}] [get_ports {dataIn[11]}] [get_ports {dataIn[12]}] [get_ports {dataIn[13]}] [get_ports {dataIn[14]}] [get_ports {dataIn[15]}] [get_ports {dataIn[16]}] [get_ports {dataIn[17]}] [get_ports {dataIn[18]}] [get_ports {dataIn[19]}] [get_ports {dataIn[20]}] [get_ports {dataIn[21]}] [get_ports {dataIn[22]}] [get_ports {dataIn[23]}] [get_ports {dataIn[24]}] [get_ports {dataIn[25]}] [get_ports {dataIn[26]}] [get_ports {dataIn[27]}] [get_ports {dataIn[28]}] [get_ports {dataIn[29]}] [get_ports {dataIn[30]}] [get_ports {dataIn[31]}] [get_ports {dataIn[32]}] [get_ports {dataIn[33]}] [get_ports {dataIn[34]}] [get_ports {dataIn[35]}] [get_ports {dataIn[36]}] [get_ports {dataIn[37]}] [get_ports {dataIn[38]}] [get_ports {dataIn[39]}] [get_ports {dataIn[40]}] [get_ports {dataIn[41]}] [get_ports {dataIn[42]}] [get_ports {dataIn[43]}] [get_ports {dataIn[44]}] [get_ports {dataIn[45]}] [get_ports {dataIn[46]}] [get_ports {dataIn[47]}] [get_ports {dataIn[48]}] [get_ports {dataIn[49]}] [get_ports {dataIn[50]}] [get_ports {dataIn[51]}] [get_ports {dataIn[52]}] [get_ports {dataIn[53]}] [get_ports {dataIn[54]}] [get_ports {dataIn[55]}] [get_ports {dataIn[56]}] [get_ports {dataIn[57]}] [get_ports {dataIn[58]}] [get_ports {dataIn[59]}] [get_ports {dataIn[60]}] [get_ports {dataIn[61]}] [get_ports {dataIn[62]}] [get_ports {dataIn[63]}] [get_ports {address_WR[0]}] [get_ports {address_WR[1]}] [get_ports {address_WR[2]}] [get_ports {address_WR[3]}] [get_ports {address_WR[4]}] [get_ports {address_WR[5]}] [get_ports {address_WR[6]}] [get_ports {address_WR[7]}] [get_ports {address_WR[8]}] [get_ports {address_WR[9]}] [get_ports {address_WR[10]}] [get_ports {address_WR[11]}] [get_ports {address_WR[12]}] [get_ports {address_RD2[0]}] [get_ports {address_RD2[1]}] [get_ports {address_RD2[2]}] [get_ports {address_RD2[3]}] [get_ports {address_RD2[4]}] [get_ports {address_RD2[5]}] [get_ports {address_RD2[6]}] [get_ports {address_RD2[7]}] [get_ports {address_RD2[8]}] [get_ports {address_RD2[9]}] [get_ports {address_RD2[10]}] [get_ports {address_RD2[11]}] [get_ports {address_RD2[12]}] [get_ports {address_RD1[0]}] [get_ports {address_RD1[1]}] [get_ports {address_RD1[2]}] [get_ports {address_RD1[3]}] [get_ports {address_RD1[4]}] [get_ports {address_RD1[5]}] [get_ports {address_RD1[6]}] [get_ports {address_RD1[7]}] [get_ports {address_RD1[8]}] [get_ports {address_RD1[9]}] [get_ports {address_RD1[10]}] [get_ports {address_RD1[11]}] [get_ports {address_RD1[12]}] [get_ports WR_Enable] [get_ports RST] [get_ports CLK]]
group_path -name I2O -from [list [get_ports {dataIn[0]}] [get_ports {dataIn[1]}] [get_ports {dataIn[2]}] [get_ports {dataIn[3]}] [get_ports {dataIn[4]}] [get_ports {dataIn[5]}] [get_ports {dataIn[6]}] [get_ports {dataIn[7]}] [get_ports {dataIn[8]}] [get_ports {dataIn[9]}] [get_ports {dataIn[10]}] [get_ports {dataIn[11]}] [get_ports {dataIn[12]}] [get_ports {dataIn[13]}] [get_ports {dataIn[14]}] [get_ports {dataIn[15]}] [get_ports {dataIn[16]}] [get_ports {dataIn[17]}] [get_ports {dataIn[18]}] [get_ports {dataIn[19]}] [get_ports {dataIn[20]}] [get_ports {dataIn[21]}] [get_ports {dataIn[22]}] [get_ports {dataIn[23]}] [get_ports {dataIn[24]}] [get_ports {dataIn[25]}] [get_ports {dataIn[26]}] [get_ports {dataIn[27]}] [get_ports {dataIn[28]}] [get_ports {dataIn[29]}] [get_ports {dataIn[30]}] [get_ports {dataIn[31]}] [get_ports {dataIn[32]}] [get_ports {dataIn[33]}] [get_ports {dataIn[34]}] [get_ports {dataIn[35]}] [get_ports {dataIn[36]}] [get_ports {dataIn[37]}] [get_ports {dataIn[38]}] [get_ports {dataIn[39]}] [get_ports {dataIn[40]}] [get_ports {dataIn[41]}] [get_ports {dataIn[42]}] [get_ports {dataIn[43]}] [get_ports {dataIn[44]}] [get_ports {dataIn[45]}] [get_ports {dataIn[46]}] [get_ports {dataIn[47]}] [get_ports {dataIn[48]}] [get_ports {dataIn[49]}] [get_ports {dataIn[50]}] [get_ports {dataIn[51]}] [get_ports {dataIn[52]}] [get_ports {dataIn[53]}] [get_ports {dataIn[54]}] [get_ports {dataIn[55]}] [get_ports {dataIn[56]}] [get_ports {dataIn[57]}] [get_ports {dataIn[58]}] [get_ports {dataIn[59]}] [get_ports {dataIn[60]}] [get_ports {dataIn[61]}] [get_ports {dataIn[62]}] [get_ports {dataIn[63]}] [get_ports {address_WR[0]}] [get_ports {address_WR[1]}] [get_ports {address_WR[2]}] [get_ports {address_WR[3]}] [get_ports {address_WR[4]}] [get_ports {address_WR[5]}] [get_ports {address_WR[6]}] [get_ports {address_WR[7]}] [get_ports {address_WR[8]}] [get_ports {address_WR[9]}] [get_ports {address_WR[10]}] [get_ports {address_WR[11]}] [get_ports {address_WR[12]}] [get_ports {address_RD2[0]}] [get_ports {address_RD2[1]}] [get_ports {address_RD2[2]}] [get_ports {address_RD2[3]}] [get_ports {address_RD2[4]}] [get_ports {address_RD2[5]}] [get_ports {address_RD2[6]}] [get_ports {address_RD2[7]}] [get_ports {address_RD2[8]}] [get_ports {address_RD2[9]}] [get_ports {address_RD2[10]}] [get_ports {address_RD2[11]}] [get_ports {address_RD2[12]}] [get_ports {address_RD1[0]}] [get_ports {address_RD1[1]}] [get_ports {address_RD1[2]}] [get_ports {address_RD1[3]}] [get_ports {address_RD1[4]}] [get_ports {address_RD1[5]}] [get_ports {address_RD1[6]}] [get_ports {address_RD1[7]}] [get_ports {address_RD1[8]}] [get_ports {address_RD1[9]}] [get_ports {address_RD1[10]}] [get_ports {address_RD1[11]}] [get_ports {address_RD1[12]}] [get_ports WR_Enable] [get_ports RST] [get_ports CLK]]  -to [list [get_ports {dataOut2[0]}] [get_ports {dataOut2[1]}] [get_ports {dataOut2[2]}] [get_ports {dataOut2[3]}] [get_ports {dataOut2[4]}] [get_ports {dataOut2[5]}] [get_ports {dataOut2[6]}] [get_ports {dataOut2[7]}] [get_ports {dataOut2[8]}] [get_ports {dataOut2[9]}] [get_ports {dataOut2[10]}] [get_ports {dataOut2[11]}] [get_ports {dataOut2[12]}] [get_ports {dataOut2[13]}] [get_ports {dataOut2[14]}] [get_ports {dataOut2[15]}] [get_ports {dataOut2[16]}] [get_ports {dataOut2[17]}] [get_ports {dataOut2[18]}] [get_ports {dataOut2[19]}] [get_ports {dataOut2[20]}] [get_ports {dataOut2[21]}] [get_ports {dataOut2[22]}] [get_ports {dataOut2[23]}] [get_ports {dataOut2[24]}] [get_ports {dataOut2[25]}] [get_ports {dataOut2[26]}] [get_ports {dataOut2[27]}] [get_ports {dataOut2[28]}] [get_ports {dataOut2[29]}] [get_ports {dataOut2[30]}] [get_ports {dataOut2[31]}] [get_ports {dataOut2[32]}] [get_ports {dataOut2[33]}] [get_ports {dataOut2[34]}] [get_ports {dataOut2[35]}] [get_ports {dataOut2[36]}] [get_ports {dataOut2[37]}] [get_ports {dataOut2[38]}] [get_ports {dataOut2[39]}] [get_ports {dataOut2[40]}] [get_ports {dataOut2[41]}] [get_ports {dataOut2[42]}] [get_ports {dataOut2[43]}] [get_ports {dataOut2[44]}] [get_ports {dataOut2[45]}] [get_ports {dataOut2[46]}] [get_ports {dataOut2[47]}] [get_ports {dataOut2[48]}] [get_ports {dataOut2[49]}] [get_ports {dataOut2[50]}] [get_ports {dataOut2[51]}] [get_ports {dataOut2[52]}] [get_ports {dataOut2[53]}] [get_ports {dataOut2[54]}] [get_ports {dataOut2[55]}] [get_ports {dataOut2[56]}] [get_ports {dataOut2[57]}] [get_ports {dataOut2[58]}] [get_ports {dataOut2[59]}] [get_ports {dataOut2[60]}] [get_ports {dataOut2[61]}] [get_ports {dataOut2[62]}] [get_ports {dataOut2[63]}] [get_ports {dataOut1[0]}] [get_ports {dataOut1[1]}] [get_ports {dataOut1[2]}] [get_ports {dataOut1[3]}] [get_ports {dataOut1[4]}] [get_ports {dataOut1[5]}] [get_ports {dataOut1[6]}] [get_ports {dataOut1[7]}] [get_ports {dataOut1[8]}] [get_ports {dataOut1[9]}] [get_ports {dataOut1[10]}] [get_ports {dataOut1[11]}] [get_ports {dataOut1[12]}] [get_ports {dataOut1[13]}] [get_ports {dataOut1[14]}] [get_ports {dataOut1[15]}] [get_ports {dataOut1[16]}] [get_ports {dataOut1[17]}] [get_ports {dataOut1[18]}] [get_ports {dataOut1[19]}] [get_ports {dataOut1[20]}] [get_ports {dataOut1[21]}] [get_ports {dataOut1[22]}] [get_ports {dataOut1[23]}] [get_ports {dataOut1[24]}] [get_ports {dataOut1[25]}] [get_ports {dataOut1[26]}] [get_ports {dataOut1[27]}] [get_ports {dataOut1[28]}] [get_ports {dataOut1[29]}] [get_ports {dataOut1[30]}] [get_ports {dataOut1[31]}] [get_ports {dataOut1[32]}] [get_ports {dataOut1[33]}] [get_ports {dataOut1[34]}] [get_ports {dataOut1[35]}] [get_ports {dataOut1[36]}] [get_ports {dataOut1[37]}] [get_ports {dataOut1[38]}] [get_ports {dataOut1[39]}] [get_ports {dataOut1[40]}] [get_ports {dataOut1[41]}] [get_ports {dataOut1[42]}] [get_ports {dataOut1[43]}] [get_ports {dataOut1[44]}] [get_ports {dataOut1[45]}] [get_ports {dataOut1[46]}] [get_ports {dataOut1[47]}] [get_ports {dataOut1[48]}] [get_ports {dataOut1[49]}] [get_ports {dataOut1[50]}] [get_ports {dataOut1[51]}] [get_ports {dataOut1[52]}] [get_ports {dataOut1[53]}] [get_ports {dataOut1[54]}] [get_ports {dataOut1[55]}] [get_ports {dataOut1[56]}] [get_ports {dataOut1[57]}] [get_ports {dataOut1[58]}] [get_ports {dataOut1[59]}] [get_ports {dataOut1[60]}] [get_ports {dataOut1[61]}] [get_ports {dataOut1[62]}] [get_ports {dataOut1[63]}]]
group_path -name R2O -to [list [get_ports {dataOut2[0]}] [get_ports {dataOut2[1]}] [get_ports {dataOut2[2]}] [get_ports {dataOut2[3]}] [get_ports {dataOut2[4]}] [get_ports {dataOut2[5]}] [get_ports {dataOut2[6]}] [get_ports {dataOut2[7]}] [get_ports {dataOut2[8]}] [get_ports {dataOut2[9]}] [get_ports {dataOut2[10]}] [get_ports {dataOut2[11]}] [get_ports {dataOut2[12]}] [get_ports {dataOut2[13]}] [get_ports {dataOut2[14]}] [get_ports {dataOut2[15]}] [get_ports {dataOut2[16]}] [get_ports {dataOut2[17]}] [get_ports {dataOut2[18]}] [get_ports {dataOut2[19]}] [get_ports {dataOut2[20]}] [get_ports {dataOut2[21]}] [get_ports {dataOut2[22]}] [get_ports {dataOut2[23]}] [get_ports {dataOut2[24]}] [get_ports {dataOut2[25]}] [get_ports {dataOut2[26]}] [get_ports {dataOut2[27]}] [get_ports {dataOut2[28]}] [get_ports {dataOut2[29]}] [get_ports {dataOut2[30]}] [get_ports {dataOut2[31]}] [get_ports {dataOut2[32]}] [get_ports {dataOut2[33]}] [get_ports {dataOut2[34]}] [get_ports {dataOut2[35]}] [get_ports {dataOut2[36]}] [get_ports {dataOut2[37]}] [get_ports {dataOut2[38]}] [get_ports {dataOut2[39]}] [get_ports {dataOut2[40]}] [get_ports {dataOut2[41]}] [get_ports {dataOut2[42]}] [get_ports {dataOut2[43]}] [get_ports {dataOut2[44]}] [get_ports {dataOut2[45]}] [get_ports {dataOut2[46]}] [get_ports {dataOut2[47]}] [get_ports {dataOut2[48]}] [get_ports {dataOut2[49]}] [get_ports {dataOut2[50]}] [get_ports {dataOut2[51]}] [get_ports {dataOut2[52]}] [get_ports {dataOut2[53]}] [get_ports {dataOut2[54]}] [get_ports {dataOut2[55]}] [get_ports {dataOut2[56]}] [get_ports {dataOut2[57]}] [get_ports {dataOut2[58]}] [get_ports {dataOut2[59]}] [get_ports {dataOut2[60]}] [get_ports {dataOut2[61]}] [get_ports {dataOut2[62]}] [get_ports {dataOut2[63]}] [get_ports {dataOut1[0]}] [get_ports {dataOut1[1]}] [get_ports {dataOut1[2]}] [get_ports {dataOut1[3]}] [get_ports {dataOut1[4]}] [get_ports {dataOut1[5]}] [get_ports {dataOut1[6]}] [get_ports {dataOut1[7]}] [get_ports {dataOut1[8]}] [get_ports {dataOut1[9]}] [get_ports {dataOut1[10]}] [get_ports {dataOut1[11]}] [get_ports {dataOut1[12]}] [get_ports {dataOut1[13]}] [get_ports {dataOut1[14]}] [get_ports {dataOut1[15]}] [get_ports {dataOut1[16]}] [get_ports {dataOut1[17]}] [get_ports {dataOut1[18]}] [get_ports {dataOut1[19]}] [get_ports {dataOut1[20]}] [get_ports {dataOut1[21]}] [get_ports {dataOut1[22]}] [get_ports {dataOut1[23]}] [get_ports {dataOut1[24]}] [get_ports {dataOut1[25]}] [get_ports {dataOut1[26]}] [get_ports {dataOut1[27]}] [get_ports {dataOut1[28]}] [get_ports {dataOut1[29]}] [get_ports {dataOut1[30]}] [get_ports {dataOut1[31]}] [get_ports {dataOut1[32]}] [get_ports {dataOut1[33]}] [get_ports {dataOut1[34]}] [get_ports {dataOut1[35]}] [get_ports {dataOut1[36]}] [get_ports {dataOut1[37]}] [get_ports {dataOut1[38]}] [get_ports {dataOut1[39]}] [get_ports {dataOut1[40]}] [get_ports {dataOut1[41]}] [get_ports {dataOut1[42]}] [get_ports {dataOut1[43]}] [get_ports {dataOut1[44]}] [get_ports {dataOut1[45]}] [get_ports {dataOut1[46]}] [get_ports {dataOut1[47]}] [get_ports {dataOut1[48]}] [get_ports {dataOut1[49]}] [get_ports {dataOut1[50]}] [get_ports {dataOut1[51]}] [get_ports {dataOut1[52]}] [get_ports {dataOut1[53]}] [get_ports {dataOut1[54]}] [get_ports {dataOut1[55]}] [get_ports {dataOut1[56]}] [get_ports {dataOut1[57]}] [get_ports {dataOut1[58]}] [get_ports {dataOut1[59]}] [get_ports {dataOut1[60]}] [get_ports {dataOut1[61]}] [get_ports {dataOut1[62]}] [get_ports {dataOut1[63]}]]
set_load 5 [get_ports {dataOut1[63]}]
set_load 5 [get_ports {dataOut1[62]}]
set_load 5 [get_ports {dataOut1[61]}]
set_load 5 [get_ports {dataOut1[60]}]
set_load 5 [get_ports {dataOut1[59]}]
set_load 5 [get_ports {dataOut1[58]}]
set_load 5 [get_ports {dataOut1[57]}]
set_load 5 [get_ports {dataOut1[56]}]
set_load 5 [get_ports {dataOut1[55]}]
set_load 5 [get_ports {dataOut1[54]}]
set_load 5 [get_ports {dataOut1[53]}]
set_load 5 [get_ports {dataOut1[52]}]
set_load 5 [get_ports {dataOut1[51]}]
set_load 5 [get_ports {dataOut1[50]}]
set_load 5 [get_ports {dataOut1[49]}]
set_load 5 [get_ports {dataOut1[48]}]
set_load 5 [get_ports {dataOut1[47]}]
set_load 5 [get_ports {dataOut1[46]}]
set_load 5 [get_ports {dataOut1[45]}]
set_load 5 [get_ports {dataOut1[44]}]
set_load 5 [get_ports {dataOut1[43]}]
set_load 5 [get_ports {dataOut1[42]}]
set_load 5 [get_ports {dataOut1[41]}]
set_load 5 [get_ports {dataOut1[40]}]
set_load 5 [get_ports {dataOut1[39]}]
set_load 5 [get_ports {dataOut1[38]}]
set_load 5 [get_ports {dataOut1[37]}]
set_load 5 [get_ports {dataOut1[36]}]
set_load 5 [get_ports {dataOut1[35]}]
set_load 5 [get_ports {dataOut1[34]}]
set_load 5 [get_ports {dataOut1[33]}]
set_load 5 [get_ports {dataOut1[32]}]
set_load 5 [get_ports {dataOut1[31]}]
set_load 5 [get_ports {dataOut1[30]}]
set_load 5 [get_ports {dataOut1[29]}]
set_load 5 [get_ports {dataOut1[28]}]
set_load 5 [get_ports {dataOut1[27]}]
set_load 5 [get_ports {dataOut1[26]}]
set_load 5 [get_ports {dataOut1[25]}]
set_load 5 [get_ports {dataOut1[24]}]
set_load 5 [get_ports {dataOut1[23]}]
set_load 5 [get_ports {dataOut1[22]}]
set_load 5 [get_ports {dataOut1[21]}]
set_load 5 [get_ports {dataOut1[20]}]
set_load 5 [get_ports {dataOut1[19]}]
set_load 5 [get_ports {dataOut1[18]}]
set_load 5 [get_ports {dataOut1[17]}]
set_load 5 [get_ports {dataOut1[16]}]
set_load 5 [get_ports {dataOut1[15]}]
set_load 5 [get_ports {dataOut1[14]}]
set_load 5 [get_ports {dataOut1[13]}]
set_load 5 [get_ports {dataOut1[12]}]
set_load 5 [get_ports {dataOut1[11]}]
set_load 5 [get_ports {dataOut1[10]}]
set_load 5 [get_ports {dataOut1[9]}]
set_load 5 [get_ports {dataOut1[8]}]
set_load 5 [get_ports {dataOut1[7]}]
set_load 5 [get_ports {dataOut1[6]}]
set_load 5 [get_ports {dataOut1[5]}]
set_load 5 [get_ports {dataOut1[4]}]
set_load 5 [get_ports {dataOut1[3]}]
set_load 5 [get_ports {dataOut1[2]}]
set_load 5 [get_ports {dataOut1[1]}]
set_load 5 [get_ports {dataOut1[0]}]
set_load 5 [get_ports {dataOut2[63]}]
set_load 5 [get_ports {dataOut2[62]}]
set_load 5 [get_ports {dataOut2[61]}]
set_load 5 [get_ports {dataOut2[60]}]
set_load 5 [get_ports {dataOut2[59]}]
set_load 5 [get_ports {dataOut2[58]}]
set_load 5 [get_ports {dataOut2[57]}]
set_load 5 [get_ports {dataOut2[56]}]
set_load 5 [get_ports {dataOut2[55]}]
set_load 5 [get_ports {dataOut2[54]}]
set_load 5 [get_ports {dataOut2[53]}]
set_load 5 [get_ports {dataOut2[52]}]
set_load 5 [get_ports {dataOut2[51]}]
set_load 5 [get_ports {dataOut2[50]}]
set_load 5 [get_ports {dataOut2[49]}]
set_load 5 [get_ports {dataOut2[48]}]
set_load 5 [get_ports {dataOut2[47]}]
set_load 5 [get_ports {dataOut2[46]}]
set_load 5 [get_ports {dataOut2[45]}]
set_load 5 [get_ports {dataOut2[44]}]
set_load 5 [get_ports {dataOut2[43]}]
set_load 5 [get_ports {dataOut2[42]}]
set_load 5 [get_ports {dataOut2[41]}]
set_load 5 [get_ports {dataOut2[40]}]
set_load 5 [get_ports {dataOut2[39]}]
set_load 5 [get_ports {dataOut2[38]}]
set_load 5 [get_ports {dataOut2[37]}]
set_load 5 [get_ports {dataOut2[36]}]
set_load 5 [get_ports {dataOut2[35]}]
set_load 5 [get_ports {dataOut2[34]}]
set_load 5 [get_ports {dataOut2[33]}]
set_load 5 [get_ports {dataOut2[32]}]
set_load 5 [get_ports {dataOut2[31]}]
set_load 5 [get_ports {dataOut2[30]}]
set_load 5 [get_ports {dataOut2[29]}]
set_load 5 [get_ports {dataOut2[28]}]
set_load 5 [get_ports {dataOut2[27]}]
set_load 5 [get_ports {dataOut2[26]}]
set_load 5 [get_ports {dataOut2[25]}]
set_load 5 [get_ports {dataOut2[24]}]
set_load 5 [get_ports {dataOut2[23]}]
set_load 5 [get_ports {dataOut2[22]}]
set_load 5 [get_ports {dataOut2[21]}]
set_load 5 [get_ports {dataOut2[20]}]
set_load 5 [get_ports {dataOut2[19]}]
set_load 5 [get_ports {dataOut2[18]}]
set_load 5 [get_ports {dataOut2[17]}]
set_load 5 [get_ports {dataOut2[16]}]
set_load 5 [get_ports {dataOut2[15]}]
set_load 5 [get_ports {dataOut2[14]}]
set_load 5 [get_ports {dataOut2[13]}]
set_load 5 [get_ports {dataOut2[12]}]
set_load 5 [get_ports {dataOut2[11]}]
set_load 5 [get_ports {dataOut2[10]}]
set_load 5 [get_ports {dataOut2[9]}]
set_load 5 [get_ports {dataOut2[8]}]
set_load 5 [get_ports {dataOut2[7]}]
set_load 5 [get_ports {dataOut2[6]}]
set_load 5 [get_ports {dataOut2[5]}]
set_load 5 [get_ports {dataOut2[4]}]
set_load 5 [get_ports {dataOut2[3]}]
set_load 5 [get_ports {dataOut2[2]}]
set_load 5 [get_ports {dataOut2[1]}]
set_load 5 [get_ports {dataOut2[0]}]
set_input_transition 0.1 [get_ports CLK]
set_input_transition 0.1 [get_ports RST]
set_input_transition 0.1 [get_ports WR_Enable]
set_input_transition 0.1 [get_ports {address_RD1[12]}]
set_input_transition 0.1 [get_ports {address_RD1[11]}]
set_input_transition 0.1 [get_ports {address_RD1[10]}]
set_input_transition 0.1 [get_ports {address_RD1[9]}]
set_input_transition 0.1 [get_ports {address_RD1[8]}]
set_input_transition 0.1 [get_ports {address_RD1[7]}]
set_input_transition 0.1 [get_ports {address_RD1[6]}]
set_input_transition 0.1 [get_ports {address_RD1[5]}]
set_input_transition 0.1 [get_ports {address_RD1[4]}]
set_input_transition 0.1 [get_ports {address_RD1[3]}]
set_input_transition 0.1 [get_ports {address_RD1[2]}]
set_input_transition 0.1 [get_ports {address_RD1[1]}]
set_input_transition 0.1 [get_ports {address_RD1[0]}]
set_input_transition 0.1 [get_ports {address_RD2[12]}]
set_input_transition 0.1 [get_ports {address_RD2[11]}]
set_input_transition 0.1 [get_ports {address_RD2[10]}]
set_input_transition 0.1 [get_ports {address_RD2[9]}]
set_input_transition 0.1 [get_ports {address_RD2[8]}]
set_input_transition 0.1 [get_ports {address_RD2[7]}]
set_input_transition 0.1 [get_ports {address_RD2[6]}]
set_input_transition 0.1 [get_ports {address_RD2[5]}]
set_input_transition 0.1 [get_ports {address_RD2[4]}]
set_input_transition 0.1 [get_ports {address_RD2[3]}]
set_input_transition 0.1 [get_ports {address_RD2[2]}]
set_input_transition 0.1 [get_ports {address_RD2[1]}]
set_input_transition 0.1 [get_ports {address_RD2[0]}]
set_input_transition 0.1 [get_ports {address_WR[12]}]
set_input_transition 0.1 [get_ports {address_WR[11]}]
set_input_transition 0.1 [get_ports {address_WR[10]}]
set_input_transition 0.1 [get_ports {address_WR[9]}]
set_input_transition 0.1 [get_ports {address_WR[8]}]
set_input_transition 0.1 [get_ports {address_WR[7]}]
set_input_transition 0.1 [get_ports {address_WR[6]}]
set_input_transition 0.1 [get_ports {address_WR[5]}]
set_input_transition 0.1 [get_ports {address_WR[4]}]
set_input_transition 0.1 [get_ports {address_WR[3]}]
set_input_transition 0.1 [get_ports {address_WR[2]}]
set_input_transition 0.1 [get_ports {address_WR[1]}]
set_input_transition 0.1 [get_ports {address_WR[0]}]
set_input_transition 0.1 [get_ports {dataIn[63]}]
set_input_transition 0.1 [get_ports {dataIn[62]}]
set_input_transition 0.1 [get_ports {dataIn[61]}]
set_input_transition 0.1 [get_ports {dataIn[60]}]
set_input_transition 0.1 [get_ports {dataIn[59]}]
set_input_transition 0.1 [get_ports {dataIn[58]}]
set_input_transition 0.1 [get_ports {dataIn[57]}]
set_input_transition 0.1 [get_ports {dataIn[56]}]
set_input_transition 0.1 [get_ports {dataIn[55]}]
set_input_transition 0.1 [get_ports {dataIn[54]}]
set_input_transition 0.1 [get_ports {dataIn[53]}]
set_input_transition 0.1 [get_ports {dataIn[52]}]
set_input_transition 0.1 [get_ports {dataIn[51]}]
set_input_transition 0.1 [get_ports {dataIn[50]}]
set_input_transition 0.1 [get_ports {dataIn[49]}]
set_input_transition 0.1 [get_ports {dataIn[48]}]
set_input_transition 0.1 [get_ports {dataIn[47]}]
set_input_transition 0.1 [get_ports {dataIn[46]}]
set_input_transition 0.1 [get_ports {dataIn[45]}]
set_input_transition 0.1 [get_ports {dataIn[44]}]
set_input_transition 0.1 [get_ports {dataIn[43]}]
set_input_transition 0.1 [get_ports {dataIn[42]}]
set_input_transition 0.1 [get_ports {dataIn[41]}]
set_input_transition 0.1 [get_ports {dataIn[40]}]
set_input_transition 0.1 [get_ports {dataIn[39]}]
set_input_transition 0.1 [get_ports {dataIn[38]}]
set_input_transition 0.1 [get_ports {dataIn[37]}]
set_input_transition 0.1 [get_ports {dataIn[36]}]
set_input_transition 0.1 [get_ports {dataIn[35]}]
set_input_transition 0.1 [get_ports {dataIn[34]}]
set_input_transition 0.1 [get_ports {dataIn[33]}]
set_input_transition 0.1 [get_ports {dataIn[32]}]
set_input_transition 0.1 [get_ports {dataIn[31]}]
set_input_transition 0.1 [get_ports {dataIn[30]}]
set_input_transition 0.1 [get_ports {dataIn[29]}]
set_input_transition 0.1 [get_ports {dataIn[28]}]
set_input_transition 0.1 [get_ports {dataIn[27]}]
set_input_transition 0.1 [get_ports {dataIn[26]}]
set_input_transition 0.1 [get_ports {dataIn[25]}]
set_input_transition 0.1 [get_ports {dataIn[24]}]
set_input_transition 0.1 [get_ports {dataIn[23]}]
set_input_transition 0.1 [get_ports {dataIn[22]}]
set_input_transition 0.1 [get_ports {dataIn[21]}]
set_input_transition 0.1 [get_ports {dataIn[20]}]
set_input_transition 0.1 [get_ports {dataIn[19]}]
set_input_transition 0.1 [get_ports {dataIn[18]}]
set_input_transition 0.1 [get_ports {dataIn[17]}]
set_input_transition 0.1 [get_ports {dataIn[16]}]
set_input_transition 0.1 [get_ports {dataIn[15]}]
set_input_transition 0.1 [get_ports {dataIn[14]}]
set_input_transition 0.1 [get_ports {dataIn[13]}]
set_input_transition 0.1 [get_ports {dataIn[12]}]
set_input_transition 0.1 [get_ports {dataIn[11]}]
set_input_transition 0.1 [get_ports {dataIn[10]}]
set_input_transition 0.1 [get_ports {dataIn[9]}]
set_input_transition 0.1 [get_ports {dataIn[8]}]
set_input_transition 0.1 [get_ports {dataIn[7]}]
set_input_transition 0.1 [get_ports {dataIn[6]}]
set_input_transition 0.1 [get_ports {dataIn[5]}]
set_input_transition 0.1 [get_ports {dataIn[4]}]
set_input_transition 0.1 [get_ports {dataIn[3]}]
set_input_transition 0.1 [get_ports {dataIn[2]}]
set_input_transition 0.1 [get_ports {dataIn[1]}]
set_input_transition 0.1 [get_ports {dataIn[0]}]
set_input_delay 0.7 [get_ports CLK]
set_input_delay 0.7 [get_ports RST]
set_input_delay 0.7 [get_ports WR_Enable]
set_input_delay 0.7 [get_ports {address_RD1[12]}]
set_input_delay 0.7 [get_ports {address_RD1[11]}]
set_input_delay 0.7 [get_ports {address_RD1[10]}]
set_input_delay 0.7 [get_ports {address_RD1[9]}]
set_input_delay 0.7 [get_ports {address_RD1[8]}]
set_input_delay 0.7 [get_ports {address_RD1[7]}]
set_input_delay 0.7 [get_ports {address_RD1[6]}]
set_input_delay 0.7 [get_ports {address_RD1[5]}]
set_input_delay 0.7 [get_ports {address_RD1[4]}]
set_input_delay 0.7 [get_ports {address_RD1[3]}]
set_input_delay 0.7 [get_ports {address_RD1[2]}]
set_input_delay 0.7 [get_ports {address_RD1[1]}]
set_input_delay 0.7 [get_ports {address_RD1[0]}]
set_input_delay 0.7 [get_ports {address_RD2[12]}]
set_input_delay 0.7 [get_ports {address_RD2[11]}]
set_input_delay 0.7 [get_ports {address_RD2[10]}]
set_input_delay 0.7 [get_ports {address_RD2[9]}]
set_input_delay 0.7 [get_ports {address_RD2[8]}]
set_input_delay 0.7 [get_ports {address_RD2[7]}]
set_input_delay 0.7 [get_ports {address_RD2[6]}]
set_input_delay 0.7 [get_ports {address_RD2[5]}]
set_input_delay 0.7 [get_ports {address_RD2[4]}]
set_input_delay 0.7 [get_ports {address_RD2[3]}]
set_input_delay 0.7 [get_ports {address_RD2[2]}]
set_input_delay 0.7 [get_ports {address_RD2[1]}]
set_input_delay 0.7 [get_ports {address_RD2[0]}]
set_input_delay 0.7 [get_ports {address_WR[12]}]
set_input_delay 0.7 [get_ports {address_WR[11]}]
set_input_delay 0.7 [get_ports {address_WR[10]}]
set_input_delay 0.7 [get_ports {address_WR[9]}]
set_input_delay 0.7 [get_ports {address_WR[8]}]
set_input_delay 0.7 [get_ports {address_WR[7]}]
set_input_delay 0.7 [get_ports {address_WR[6]}]
set_input_delay 0.7 [get_ports {address_WR[5]}]
set_input_delay 0.7 [get_ports {address_WR[4]}]
set_input_delay 0.7 [get_ports {address_WR[3]}]
set_input_delay 0.7 [get_ports {address_WR[2]}]
set_input_delay 0.7 [get_ports {address_WR[1]}]
set_input_delay 0.7 [get_ports {address_WR[0]}]
set_input_delay 0.7 [get_ports {dataIn[63]}]
set_input_delay 0.7 [get_ports {dataIn[62]}]
set_input_delay 0.7 [get_ports {dataIn[61]}]
set_input_delay 0.7 [get_ports {dataIn[60]}]
set_input_delay 0.7 [get_ports {dataIn[59]}]
set_input_delay 0.7 [get_ports {dataIn[58]}]
set_input_delay 0.7 [get_ports {dataIn[57]}]
set_input_delay 0.7 [get_ports {dataIn[56]}]
set_input_delay 0.7 [get_ports {dataIn[55]}]
set_input_delay 0.7 [get_ports {dataIn[54]}]
set_input_delay 0.7 [get_ports {dataIn[53]}]
set_input_delay 0.7 [get_ports {dataIn[52]}]
set_input_delay 0.7 [get_ports {dataIn[51]}]
set_input_delay 0.7 [get_ports {dataIn[50]}]
set_input_delay 0.7 [get_ports {dataIn[49]}]
set_input_delay 0.7 [get_ports {dataIn[48]}]
set_input_delay 0.7 [get_ports {dataIn[47]}]
set_input_delay 0.7 [get_ports {dataIn[46]}]
set_input_delay 0.7 [get_ports {dataIn[45]}]
set_input_delay 0.7 [get_ports {dataIn[44]}]
set_input_delay 0.7 [get_ports {dataIn[43]}]
set_input_delay 0.7 [get_ports {dataIn[42]}]
set_input_delay 0.7 [get_ports {dataIn[41]}]
set_input_delay 0.7 [get_ports {dataIn[40]}]
set_input_delay 0.7 [get_ports {dataIn[39]}]
set_input_delay 0.7 [get_ports {dataIn[38]}]
set_input_delay 0.7 [get_ports {dataIn[37]}]
set_input_delay 0.7 [get_ports {dataIn[36]}]
set_input_delay 0.7 [get_ports {dataIn[35]}]
set_input_delay 0.7 [get_ports {dataIn[34]}]
set_input_delay 0.7 [get_ports {dataIn[33]}]
set_input_delay 0.7 [get_ports {dataIn[32]}]
set_input_delay 0.7 [get_ports {dataIn[31]}]
set_input_delay 0.7 [get_ports {dataIn[30]}]
set_input_delay 0.7 [get_ports {dataIn[29]}]
set_input_delay 0.7 [get_ports {dataIn[28]}]
set_input_delay 0.7 [get_ports {dataIn[27]}]
set_input_delay 0.7 [get_ports {dataIn[26]}]
set_input_delay 0.7 [get_ports {dataIn[25]}]
set_input_delay 0.7 [get_ports {dataIn[24]}]
set_input_delay 0.7 [get_ports {dataIn[23]}]
set_input_delay 0.7 [get_ports {dataIn[22]}]
set_input_delay 0.7 [get_ports {dataIn[21]}]
set_input_delay 0.7 [get_ports {dataIn[20]}]
set_input_delay 0.7 [get_ports {dataIn[19]}]
set_input_delay 0.7 [get_ports {dataIn[18]}]
set_input_delay 0.7 [get_ports {dataIn[17]}]
set_input_delay 0.7 [get_ports {dataIn[16]}]
set_input_delay 0.7 [get_ports {dataIn[15]}]
set_input_delay 0.7 [get_ports {dataIn[14]}]
set_input_delay 0.7 [get_ports {dataIn[13]}]
set_input_delay 0.7 [get_ports {dataIn[12]}]
set_input_delay 0.7 [get_ports {dataIn[11]}]
set_input_delay 0.7 [get_ports {dataIn[10]}]
set_input_delay 0.7 [get_ports {dataIn[9]}]
set_input_delay 0.7 [get_ports {dataIn[8]}]
set_input_delay 0.7 [get_ports {dataIn[7]}]
set_input_delay 0.7 [get_ports {dataIn[6]}]
set_input_delay 0.7 [get_ports {dataIn[5]}]
set_input_delay 0.7 [get_ports {dataIn[4]}]
set_input_delay 0.7 [get_ports {dataIn[3]}]
set_input_delay 0.7 [get_ports {dataIn[2]}]
set_input_delay 0.7 [get_ports {dataIn[1]}]
set_input_delay 0.7 [get_ports {dataIn[0]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[63]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[62]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[61]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[60]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[59]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[58]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[57]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[56]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[55]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[54]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[53]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[52]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[51]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[50]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[49]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[48]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[47]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[46]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[45]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[44]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[43]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[42]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[41]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[40]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[39]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[38]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[37]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[36]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[35]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[34]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[33]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[32]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[31]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[30]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[29]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[28]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[27]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[26]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[25]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[24]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[23]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[22]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[21]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[20]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[19]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[18]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[17]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[16]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[15]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[14]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[13]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[12]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[11]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[10]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[9]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[8]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[7]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[6]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[5]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[4]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[3]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[2]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[1]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut1[0]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[63]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[62]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[61]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[60]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[59]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[58]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[57]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[56]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[55]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[54]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[53]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[52]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[51]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[50]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[49]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[48]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[47]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[46]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[45]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[44]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[43]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[42]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[41]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[40]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[39]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[38]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[37]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[36]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[35]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[34]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[33]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[32]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[31]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[30]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[29]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[28]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[27]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[26]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[25]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[24]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[23]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[22]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[21]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[20]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[19]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[18]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[17]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[16]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[15]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[14]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[13]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[12]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[11]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[10]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[9]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[8]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[7]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[6]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[5]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[4]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[3]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[2]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[1]}]
set_output_delay 0.45 -clock vsysclk [get_ports {dataOut2[0]}]
set_operating_conditions  -library  [get_libs {NangateOpenCellLibrary}] -max  typical
