#
# Created by 
#   ../bin/Linux-x86_64-O/oasysGui 19.2-p002 on Sat Apr 25 20:54:17 2020
# (C) Mentor Graphics Corporation
#
set_units -time ns -capacitance ff -resistance kohm -power nW -voltage V -current mA
create_clock -period 10 -waveform {0 5} -name sysclk [get_ports CLK]
create_clock -period 1 -waveform {0 0.5} -name vsysclk 
set_false_path -from [get_ports RST]
group_path -name I2R -from [list [get_ports {RAM_DATA_RD2[0]}] [get_ports {RAM_DATA_RD2[1]}] [get_ports {RAM_DATA_RD2[2]}] [get_ports {RAM_DATA_RD2[3]}] [get_ports {RAM_DATA_RD2[4]}] [get_ports {RAM_DATA_RD2[5]}] [get_ports {RAM_DATA_RD2[6]}] [get_ports {RAM_DATA_RD2[7]}] [get_ports {RAM_DATA_RD2[8]}] [get_ports {RAM_DATA_RD2[9]}] [get_ports {RAM_DATA_RD2[10]}] [get_ports {RAM_DATA_RD2[11]}] [get_ports {RAM_DATA_RD2[12]}] [get_ports {RAM_DATA_RD2[13]}] [get_ports {RAM_DATA_RD2[14]}] [get_ports {RAM_DATA_RD2[15]}] [get_ports {RAM_DATA_RD2[16]}] [get_ports {RAM_DATA_RD2[17]}] [get_ports {RAM_DATA_RD2[18]}] [get_ports {RAM_DATA_RD2[19]}] [get_ports {RAM_DATA_RD2[20]}] [get_ports {RAM_DATA_RD2[21]}] [get_ports {RAM_DATA_RD2[22]}] [get_ports {RAM_DATA_RD2[23]}] [get_ports {RAM_DATA_RD2[24]}] [get_ports {RAM_DATA_RD2[25]}] [get_ports {RAM_DATA_RD2[26]}] [get_ports {RAM_DATA_RD2[27]}] [get_ports {RAM_DATA_RD2[28]}] [get_ports {RAM_DATA_RD2[29]}] [get_ports {RAM_DATA_RD2[30]}] [get_ports {RAM_DATA_RD2[31]}] [get_ports {RAM_DATA_RD2[32]}] [get_ports {RAM_DATA_RD2[33]}] [get_ports {RAM_DATA_RD2[34]}] [get_ports {RAM_DATA_RD2[35]}] [get_ports {RAM_DATA_RD2[36]}] [get_ports {RAM_DATA_RD2[37]}] [get_ports {RAM_DATA_RD2[38]}] [get_ports {RAM_DATA_RD2[39]}] [get_ports {RAM_DATA_RD2[40]}] [get_ports {RAM_DATA_RD2[41]}] [get_ports {RAM_DATA_RD2[42]}] [get_ports {RAM_DATA_RD2[43]}] [get_ports {RAM_DATA_RD2[44]}] [get_ports {RAM_DATA_RD2[45]}] [get_ports {RAM_DATA_RD2[46]}] [get_ports {RAM_DATA_RD2[47]}] [get_ports {RAM_DATA_RD2[48]}] [get_ports {RAM_DATA_RD2[49]}] [get_ports {RAM_DATA_RD2[50]}] [get_ports {RAM_DATA_RD2[51]}] [get_ports {RAM_DATA_RD2[52]}] [get_ports {RAM_DATA_RD2[53]}] [get_ports {RAM_DATA_RD2[54]}] [get_ports {RAM_DATA_RD2[55]}] [get_ports {RAM_DATA_RD2[56]}] [get_ports {RAM_DATA_RD2[57]}] [get_ports {RAM_DATA_RD2[58]}] [get_ports {RAM_DATA_RD2[59]}] [get_ports {RAM_DATA_RD2[60]}] [get_ports {RAM_DATA_RD2[61]}] [get_ports {RAM_DATA_RD2[62]}] [get_ports {RAM_DATA_RD2[63]}] [get_ports {RAM_DATA_RD1[0]}] [get_ports {RAM_DATA_RD1[1]}] [get_ports {RAM_DATA_RD1[2]}] [get_ports {RAM_DATA_RD1[3]}] [get_ports {RAM_DATA_RD1[4]}] [get_ports {RAM_DATA_RD1[5]}] [get_ports {RAM_DATA_RD1[6]}] [get_ports {RAM_DATA_RD1[7]}] [get_ports {RAM_DATA_RD1[8]}] [get_ports {RAM_DATA_RD1[9]}] [get_ports {RAM_DATA_RD1[10]}] [get_ports {RAM_DATA_RD1[11]}] [get_ports {RAM_DATA_RD1[12]}] [get_ports {RAM_DATA_RD1[13]}] [get_ports {RAM_DATA_RD1[14]}] [get_ports {RAM_DATA_RD1[15]}] [get_ports {RAM_DATA_RD1[16]}] [get_ports {RAM_DATA_RD1[17]}] [get_ports {RAM_DATA_RD1[18]}] [get_ports {RAM_DATA_RD1[19]}] [get_ports {RAM_DATA_RD1[20]}] [get_ports {RAM_DATA_RD1[21]}] [get_ports {RAM_DATA_RD1[22]}] [get_ports {RAM_DATA_RD1[23]}] [get_ports {RAM_DATA_RD1[24]}] [get_ports {RAM_DATA_RD1[25]}] [get_ports {RAM_DATA_RD1[26]}] [get_ports {RAM_DATA_RD1[27]}] [get_ports {RAM_DATA_RD1[28]}] [get_ports {RAM_DATA_RD1[29]}] [get_ports {RAM_DATA_RD1[30]}] [get_ports {RAM_DATA_RD1[31]}] [get_ports {RAM_DATA_RD1[32]}] [get_ports {RAM_DATA_RD1[33]}] [get_ports {RAM_DATA_RD1[34]}] [get_ports {RAM_DATA_RD1[35]}] [get_ports {RAM_DATA_RD1[36]}] [get_ports {RAM_DATA_RD1[37]}] [get_ports {RAM_DATA_RD1[38]}] [get_ports {RAM_DATA_RD1[39]}] [get_ports {RAM_DATA_RD1[40]}] [get_ports {RAM_DATA_RD1[41]}] [get_ports {RAM_DATA_RD1[42]}] [get_ports {RAM_DATA_RD1[43]}] [get_ports {RAM_DATA_RD1[44]}] [get_ports {RAM_DATA_RD1[45]}] [get_ports {RAM_DATA_RD1[46]}] [get_ports {RAM_DATA_RD1[47]}] [get_ports {RAM_DATA_RD1[48]}] [get_ports {RAM_DATA_RD1[49]}] [get_ports {RAM_DATA_RD1[50]}] [get_ports {RAM_DATA_RD1[51]}] [get_ports {RAM_DATA_RD1[52]}] [get_ports {RAM_DATA_RD1[53]}] [get_ports {RAM_DATA_RD1[54]}] [get_ports {RAM_DATA_RD1[55]}] [get_ports {RAM_DATA_RD1[56]}] [get_ports {RAM_DATA_RD1[57]}] [get_ports {RAM_DATA_RD1[58]}] [get_ports {RAM_DATA_RD1[59]}] [get_ports {RAM_DATA_RD1[60]}] [get_ports {RAM_DATA_RD1[61]}] [get_ports {RAM_DATA_RD1[62]}] [get_ports {RAM_DATA_RD1[63]}] [get_ports Interpolate_DONE] [get_ports RST] [get_ports CLK] [get_ports INT]]
group_path -name I2O -from [list [get_ports {RAM_DATA_RD2[0]}] [get_ports {RAM_DATA_RD2[1]}] [get_ports {RAM_DATA_RD2[2]}] [get_ports {RAM_DATA_RD2[3]}] [get_ports {RAM_DATA_RD2[4]}] [get_ports {RAM_DATA_RD2[5]}] [get_ports {RAM_DATA_RD2[6]}] [get_ports {RAM_DATA_RD2[7]}] [get_ports {RAM_DATA_RD2[8]}] [get_ports {RAM_DATA_RD2[9]}] [get_ports {RAM_DATA_RD2[10]}] [get_ports {RAM_DATA_RD2[11]}] [get_ports {RAM_DATA_RD2[12]}] [get_ports {RAM_DATA_RD2[13]}] [get_ports {RAM_DATA_RD2[14]}] [get_ports {RAM_DATA_RD2[15]}] [get_ports {RAM_DATA_RD2[16]}] [get_ports {RAM_DATA_RD2[17]}] [get_ports {RAM_DATA_RD2[18]}] [get_ports {RAM_DATA_RD2[19]}] [get_ports {RAM_DATA_RD2[20]}] [get_ports {RAM_DATA_RD2[21]}] [get_ports {RAM_DATA_RD2[22]}] [get_ports {RAM_DATA_RD2[23]}] [get_ports {RAM_DATA_RD2[24]}] [get_ports {RAM_DATA_RD2[25]}] [get_ports {RAM_DATA_RD2[26]}] [get_ports {RAM_DATA_RD2[27]}] [get_ports {RAM_DATA_RD2[28]}] [get_ports {RAM_DATA_RD2[29]}] [get_ports {RAM_DATA_RD2[30]}] [get_ports {RAM_DATA_RD2[31]}] [get_ports {RAM_DATA_RD2[32]}] [get_ports {RAM_DATA_RD2[33]}] [get_ports {RAM_DATA_RD2[34]}] [get_ports {RAM_DATA_RD2[35]}] [get_ports {RAM_DATA_RD2[36]}] [get_ports {RAM_DATA_RD2[37]}] [get_ports {RAM_DATA_RD2[38]}] [get_ports {RAM_DATA_RD2[39]}] [get_ports {RAM_DATA_RD2[40]}] [get_ports {RAM_DATA_RD2[41]}] [get_ports {RAM_DATA_RD2[42]}] [get_ports {RAM_DATA_RD2[43]}] [get_ports {RAM_DATA_RD2[44]}] [get_ports {RAM_DATA_RD2[45]}] [get_ports {RAM_DATA_RD2[46]}] [get_ports {RAM_DATA_RD2[47]}] [get_ports {RAM_DATA_RD2[48]}] [get_ports {RAM_DATA_RD2[49]}] [get_ports {RAM_DATA_RD2[50]}] [get_ports {RAM_DATA_RD2[51]}] [get_ports {RAM_DATA_RD2[52]}] [get_ports {RAM_DATA_RD2[53]}] [get_ports {RAM_DATA_RD2[54]}] [get_ports {RAM_DATA_RD2[55]}] [get_ports {RAM_DATA_RD2[56]}] [get_ports {RAM_DATA_RD2[57]}] [get_ports {RAM_DATA_RD2[58]}] [get_ports {RAM_DATA_RD2[59]}] [get_ports {RAM_DATA_RD2[60]}] [get_ports {RAM_DATA_RD2[61]}] [get_ports {RAM_DATA_RD2[62]}] [get_ports {RAM_DATA_RD2[63]}] [get_ports {RAM_DATA_RD1[0]}] [get_ports {RAM_DATA_RD1[1]}] [get_ports {RAM_DATA_RD1[2]}] [get_ports {RAM_DATA_RD1[3]}] [get_ports {RAM_DATA_RD1[4]}] [get_ports {RAM_DATA_RD1[5]}] [get_ports {RAM_DATA_RD1[6]}] [get_ports {RAM_DATA_RD1[7]}] [get_ports {RAM_DATA_RD1[8]}] [get_ports {RAM_DATA_RD1[9]}] [get_ports {RAM_DATA_RD1[10]}] [get_ports {RAM_DATA_RD1[11]}] [get_ports {RAM_DATA_RD1[12]}] [get_ports {RAM_DATA_RD1[13]}] [get_ports {RAM_DATA_RD1[14]}] [get_ports {RAM_DATA_RD1[15]}] [get_ports {RAM_DATA_RD1[16]}] [get_ports {RAM_DATA_RD1[17]}] [get_ports {RAM_DATA_RD1[18]}] [get_ports {RAM_DATA_RD1[19]}] [get_ports {RAM_DATA_RD1[20]}] [get_ports {RAM_DATA_RD1[21]}] [get_ports {RAM_DATA_RD1[22]}] [get_ports {RAM_DATA_RD1[23]}] [get_ports {RAM_DATA_RD1[24]}] [get_ports {RAM_DATA_RD1[25]}] [get_ports {RAM_DATA_RD1[26]}] [get_ports {RAM_DATA_RD1[27]}] [get_ports {RAM_DATA_RD1[28]}] [get_ports {RAM_DATA_RD1[29]}] [get_ports {RAM_DATA_RD1[30]}] [get_ports {RAM_DATA_RD1[31]}] [get_ports {RAM_DATA_RD1[32]}] [get_ports {RAM_DATA_RD1[33]}] [get_ports {RAM_DATA_RD1[34]}] [get_ports {RAM_DATA_RD1[35]}] [get_ports {RAM_DATA_RD1[36]}] [get_ports {RAM_DATA_RD1[37]}] [get_ports {RAM_DATA_RD1[38]}] [get_ports {RAM_DATA_RD1[39]}] [get_ports {RAM_DATA_RD1[40]}] [get_ports {RAM_DATA_RD1[41]}] [get_ports {RAM_DATA_RD1[42]}] [get_ports {RAM_DATA_RD1[43]}] [get_ports {RAM_DATA_RD1[44]}] [get_ports {RAM_DATA_RD1[45]}] [get_ports {RAM_DATA_RD1[46]}] [get_ports {RAM_DATA_RD1[47]}] [get_ports {RAM_DATA_RD1[48]}] [get_ports {RAM_DATA_RD1[49]}] [get_ports {RAM_DATA_RD1[50]}] [get_ports {RAM_DATA_RD1[51]}] [get_ports {RAM_DATA_RD1[52]}] [get_ports {RAM_DATA_RD1[53]}] [get_ports {RAM_DATA_RD1[54]}] [get_ports {RAM_DATA_RD1[55]}] [get_ports {RAM_DATA_RD1[56]}] [get_ports {RAM_DATA_RD1[57]}] [get_ports {RAM_DATA_RD1[58]}] [get_ports {RAM_DATA_RD1[59]}] [get_ports {RAM_DATA_RD1[60]}] [get_ports {RAM_DATA_RD1[61]}] [get_ports {RAM_DATA_RD1[62]}] [get_ports {RAM_DATA_RD1[63]}] [get_ports Interpolate_DONE] [get_ports RST] [get_ports CLK] [get_ports INT]]  -to [list [get_ports RAM_ENABLE_WR] [get_ports {RAM_DATA_WR[0]}] [get_ports {RAM_DATA_WR[1]}] [get_ports {RAM_DATA_WR[2]}] [get_ports {RAM_DATA_WR[3]}] [get_ports {RAM_DATA_WR[4]}] [get_ports {RAM_DATA_WR[5]}] [get_ports {RAM_DATA_WR[6]}] [get_ports {RAM_DATA_WR[7]}] [get_ports {RAM_DATA_WR[8]}] [get_ports {RAM_DATA_WR[9]}] [get_ports {RAM_DATA_WR[10]}] [get_ports {RAM_DATA_WR[11]}] [get_ports {RAM_DATA_WR[12]}] [get_ports {RAM_DATA_WR[13]}] [get_ports {RAM_DATA_WR[14]}] [get_ports {RAM_DATA_WR[15]}] [get_ports {RAM_DATA_WR[16]}] [get_ports {RAM_DATA_WR[17]}] [get_ports {RAM_DATA_WR[18]}] [get_ports {RAM_DATA_WR[19]}] [get_ports {RAM_DATA_WR[20]}] [get_ports {RAM_DATA_WR[21]}] [get_ports {RAM_DATA_WR[22]}] [get_ports {RAM_DATA_WR[23]}] [get_ports {RAM_DATA_WR[24]}] [get_ports {RAM_DATA_WR[25]}] [get_ports {RAM_DATA_WR[26]}] [get_ports {RAM_DATA_WR[27]}] [get_ports {RAM_DATA_WR[28]}] [get_ports {RAM_DATA_WR[29]}] [get_ports {RAM_DATA_WR[30]}] [get_ports {RAM_DATA_WR[31]}] [get_ports {RAM_DATA_WR[32]}] [get_ports {RAM_DATA_WR[33]}] [get_ports {RAM_DATA_WR[34]}] [get_ports {RAM_DATA_WR[35]}] [get_ports {RAM_DATA_WR[36]}] [get_ports {RAM_DATA_WR[37]}] [get_ports {RAM_DATA_WR[38]}] [get_ports {RAM_DATA_WR[39]}] [get_ports {RAM_DATA_WR[40]}] [get_ports {RAM_DATA_WR[41]}] [get_ports {RAM_DATA_WR[42]}] [get_ports {RAM_DATA_WR[43]}] [get_ports {RAM_DATA_WR[44]}] [get_ports {RAM_DATA_WR[45]}] [get_ports {RAM_DATA_WR[46]}] [get_ports {RAM_DATA_WR[47]}] [get_ports {RAM_DATA_WR[48]}] [get_ports {RAM_DATA_WR[49]}] [get_ports {RAM_DATA_WR[50]}] [get_ports {RAM_DATA_WR[51]}] [get_ports {RAM_DATA_WR[52]}] [get_ports {RAM_DATA_WR[53]}] [get_ports {RAM_DATA_WR[54]}] [get_ports {RAM_DATA_WR[55]}] [get_ports {RAM_DATA_WR[56]}] [get_ports {RAM_DATA_WR[57]}] [get_ports {RAM_DATA_WR[58]}] [get_ports {RAM_DATA_WR[59]}] [get_ports {RAM_DATA_WR[60]}] [get_ports {RAM_DATA_WR[61]}] [get_ports {RAM_DATA_WR[62]}] [get_ports {RAM_DATA_WR[63]}] [get_ports {RAM_ADD_WR[0]}] [get_ports {RAM_ADD_WR[1]}] [get_ports {RAM_ADD_WR[2]}] [get_ports {RAM_ADD_WR[3]}] [get_ports {RAM_ADD_WR[4]}] [get_ports {RAM_ADD_WR[5]}] [get_ports {RAM_ADD_WR[6]}] [get_ports {RAM_ADD_WR[7]}] [get_ports {RAM_ADD_WR[8]}] [get_ports {RAM_ADD_WR[9]}] [get_ports {RAM_ADD_WR[10]}] [get_ports {RAM_ADD_WR[11]}] [get_ports {RAM_ADD_WR[12]}] [get_ports {RAM_ADD_RD2[0]}] [get_ports {RAM_ADD_RD2[1]}] [get_ports {RAM_ADD_RD2[2]}] [get_ports {RAM_ADD_RD2[3]}] [get_ports {RAM_ADD_RD2[4]}] [get_ports {RAM_ADD_RD2[5]}] [get_ports {RAM_ADD_RD2[6]}] [get_ports {RAM_ADD_RD2[7]}] [get_ports {RAM_ADD_RD2[8]}] [get_ports {RAM_ADD_RD2[9]}] [get_ports {RAM_ADD_RD2[10]}] [get_ports {RAM_ADD_RD2[11]}] [get_ports {RAM_ADD_RD2[12]}] [get_ports {RAM_ADD_RD1[0]}] [get_ports {RAM_ADD_RD1[1]}] [get_ports {RAM_ADD_RD1[2]}] [get_ports {RAM_ADD_RD1[3]}] [get_ports {RAM_ADD_RD1[4]}] [get_ports {RAM_ADD_RD1[5]}] [get_ports {RAM_ADD_RD1[6]}] [get_ports {RAM_ADD_RD1[7]}] [get_ports {RAM_ADD_RD1[8]}] [get_ports {RAM_ADD_RD1[9]}] [get_ports {RAM_ADD_RD1[10]}] [get_ports {RAM_ADD_RD1[11]}] [get_ports {RAM_ADD_RD1[12]}] [get_ports Interpolate_Enable] [get_ports DONE]]
group_path -name R2O -to [list [get_ports RAM_ENABLE_WR] [get_ports {RAM_DATA_WR[0]}] [get_ports {RAM_DATA_WR[1]}] [get_ports {RAM_DATA_WR[2]}] [get_ports {RAM_DATA_WR[3]}] [get_ports {RAM_DATA_WR[4]}] [get_ports {RAM_DATA_WR[5]}] [get_ports {RAM_DATA_WR[6]}] [get_ports {RAM_DATA_WR[7]}] [get_ports {RAM_DATA_WR[8]}] [get_ports {RAM_DATA_WR[9]}] [get_ports {RAM_DATA_WR[10]}] [get_ports {RAM_DATA_WR[11]}] [get_ports {RAM_DATA_WR[12]}] [get_ports {RAM_DATA_WR[13]}] [get_ports {RAM_DATA_WR[14]}] [get_ports {RAM_DATA_WR[15]}] [get_ports {RAM_DATA_WR[16]}] [get_ports {RAM_DATA_WR[17]}] [get_ports {RAM_DATA_WR[18]}] [get_ports {RAM_DATA_WR[19]}] [get_ports {RAM_DATA_WR[20]}] [get_ports {RAM_DATA_WR[21]}] [get_ports {RAM_DATA_WR[22]}] [get_ports {RAM_DATA_WR[23]}] [get_ports {RAM_DATA_WR[24]}] [get_ports {RAM_DATA_WR[25]}] [get_ports {RAM_DATA_WR[26]}] [get_ports {RAM_DATA_WR[27]}] [get_ports {RAM_DATA_WR[28]}] [get_ports {RAM_DATA_WR[29]}] [get_ports {RAM_DATA_WR[30]}] [get_ports {RAM_DATA_WR[31]}] [get_ports {RAM_DATA_WR[32]}] [get_ports {RAM_DATA_WR[33]}] [get_ports {RAM_DATA_WR[34]}] [get_ports {RAM_DATA_WR[35]}] [get_ports {RAM_DATA_WR[36]}] [get_ports {RAM_DATA_WR[37]}] [get_ports {RAM_DATA_WR[38]}] [get_ports {RAM_DATA_WR[39]}] [get_ports {RAM_DATA_WR[40]}] [get_ports {RAM_DATA_WR[41]}] [get_ports {RAM_DATA_WR[42]}] [get_ports {RAM_DATA_WR[43]}] [get_ports {RAM_DATA_WR[44]}] [get_ports {RAM_DATA_WR[45]}] [get_ports {RAM_DATA_WR[46]}] [get_ports {RAM_DATA_WR[47]}] [get_ports {RAM_DATA_WR[48]}] [get_ports {RAM_DATA_WR[49]}] [get_ports {RAM_DATA_WR[50]}] [get_ports {RAM_DATA_WR[51]}] [get_ports {RAM_DATA_WR[52]}] [get_ports {RAM_DATA_WR[53]}] [get_ports {RAM_DATA_WR[54]}] [get_ports {RAM_DATA_WR[55]}] [get_ports {RAM_DATA_WR[56]}] [get_ports {RAM_DATA_WR[57]}] [get_ports {RAM_DATA_WR[58]}] [get_ports {RAM_DATA_WR[59]}] [get_ports {RAM_DATA_WR[60]}] [get_ports {RAM_DATA_WR[61]}] [get_ports {RAM_DATA_WR[62]}] [get_ports {RAM_DATA_WR[63]}] [get_ports {RAM_ADD_WR[0]}] [get_ports {RAM_ADD_WR[1]}] [get_ports {RAM_ADD_WR[2]}] [get_ports {RAM_ADD_WR[3]}] [get_ports {RAM_ADD_WR[4]}] [get_ports {RAM_ADD_WR[5]}] [get_ports {RAM_ADD_WR[6]}] [get_ports {RAM_ADD_WR[7]}] [get_ports {RAM_ADD_WR[8]}] [get_ports {RAM_ADD_WR[9]}] [get_ports {RAM_ADD_WR[10]}] [get_ports {RAM_ADD_WR[11]}] [get_ports {RAM_ADD_WR[12]}] [get_ports {RAM_ADD_RD2[0]}] [get_ports {RAM_ADD_RD2[1]}] [get_ports {RAM_ADD_RD2[2]}] [get_ports {RAM_ADD_RD2[3]}] [get_ports {RAM_ADD_RD2[4]}] [get_ports {RAM_ADD_RD2[5]}] [get_ports {RAM_ADD_RD2[6]}] [get_ports {RAM_ADD_RD2[7]}] [get_ports {RAM_ADD_RD2[8]}] [get_ports {RAM_ADD_RD2[9]}] [get_ports {RAM_ADD_RD2[10]}] [get_ports {RAM_ADD_RD2[11]}] [get_ports {RAM_ADD_RD2[12]}] [get_ports {RAM_ADD_RD1[0]}] [get_ports {RAM_ADD_RD1[1]}] [get_ports {RAM_ADD_RD1[2]}] [get_ports {RAM_ADD_RD1[3]}] [get_ports {RAM_ADD_RD1[4]}] [get_ports {RAM_ADD_RD1[5]}] [get_ports {RAM_ADD_RD1[6]}] [get_ports {RAM_ADD_RD1[7]}] [get_ports {RAM_ADD_RD1[8]}] [get_ports {RAM_ADD_RD1[9]}] [get_ports {RAM_ADD_RD1[10]}] [get_ports {RAM_ADD_RD1[11]}] [get_ports {RAM_ADD_RD1[12]}] [get_ports Interpolate_Enable] [get_ports DONE]]
set_load 10 [get_ports DONE]
set_load 10 [get_ports Interpolate_Enable]
set_load 10 [get_ports {RAM_ADD_RD1[12]}]
set_load 10 [get_ports {RAM_ADD_RD1[11]}]
set_load 10 [get_ports {RAM_ADD_RD1[10]}]
set_load 10 [get_ports {RAM_ADD_RD1[9]}]
set_load 10 [get_ports {RAM_ADD_RD1[8]}]
set_load 10 [get_ports {RAM_ADD_RD1[7]}]
set_load 10 [get_ports {RAM_ADD_RD1[6]}]
set_load 10 [get_ports {RAM_ADD_RD1[5]}]
set_load 10 [get_ports {RAM_ADD_RD1[4]}]
set_load 10 [get_ports {RAM_ADD_RD1[3]}]
set_load 10 [get_ports {RAM_ADD_RD1[2]}]
set_load 10 [get_ports {RAM_ADD_RD1[1]}]
set_load 10 [get_ports {RAM_ADD_RD1[0]}]
set_load 10 [get_ports {RAM_ADD_RD2[12]}]
set_load 10 [get_ports {RAM_ADD_RD2[11]}]
set_load 10 [get_ports {RAM_ADD_RD2[10]}]
set_load 10 [get_ports {RAM_ADD_RD2[9]}]
set_load 10 [get_ports {RAM_ADD_RD2[8]}]
set_load 10 [get_ports {RAM_ADD_RD2[7]}]
set_load 10 [get_ports {RAM_ADD_RD2[6]}]
set_load 10 [get_ports {RAM_ADD_RD2[5]}]
set_load 10 [get_ports {RAM_ADD_RD2[4]}]
set_load 10 [get_ports {RAM_ADD_RD2[3]}]
set_load 10 [get_ports {RAM_ADD_RD2[2]}]
set_load 10 [get_ports {RAM_ADD_RD2[1]}]
set_load 10 [get_ports {RAM_ADD_RD2[0]}]
set_load 10 [get_ports {RAM_ADD_WR[12]}]
set_load 10 [get_ports {RAM_ADD_WR[11]}]
set_load 10 [get_ports {RAM_ADD_WR[10]}]
set_load 10 [get_ports {RAM_ADD_WR[9]}]
set_load 10 [get_ports {RAM_ADD_WR[8]}]
set_load 10 [get_ports {RAM_ADD_WR[7]}]
set_load 10 [get_ports {RAM_ADD_WR[6]}]
set_load 10 [get_ports {RAM_ADD_WR[5]}]
set_load 10 [get_ports {RAM_ADD_WR[4]}]
set_load 10 [get_ports {RAM_ADD_WR[3]}]
set_load 10 [get_ports {RAM_ADD_WR[2]}]
set_load 10 [get_ports {RAM_ADD_WR[1]}]
set_load 10 [get_ports {RAM_ADD_WR[0]}]
set_load 10 [get_ports {RAM_DATA_WR[63]}]
set_load 10 [get_ports {RAM_DATA_WR[62]}]
set_load 10 [get_ports {RAM_DATA_WR[61]}]
set_load 10 [get_ports {RAM_DATA_WR[60]}]
set_load 10 [get_ports {RAM_DATA_WR[59]}]
set_load 10 [get_ports {RAM_DATA_WR[58]}]
set_load 10 [get_ports {RAM_DATA_WR[57]}]
set_load 10 [get_ports {RAM_DATA_WR[56]}]
set_load 10 [get_ports {RAM_DATA_WR[55]}]
set_load 10 [get_ports {RAM_DATA_WR[54]}]
set_load 10 [get_ports {RAM_DATA_WR[53]}]
set_load 10 [get_ports {RAM_DATA_WR[52]}]
set_load 10 [get_ports {RAM_DATA_WR[51]}]
set_load 10 [get_ports {RAM_DATA_WR[50]}]
set_load 10 [get_ports {RAM_DATA_WR[49]}]
set_load 10 [get_ports {RAM_DATA_WR[48]}]
set_load 10 [get_ports {RAM_DATA_WR[47]}]
set_load 10 [get_ports {RAM_DATA_WR[46]}]
set_load 10 [get_ports {RAM_DATA_WR[45]}]
set_load 10 [get_ports {RAM_DATA_WR[44]}]
set_load 10 [get_ports {RAM_DATA_WR[43]}]
set_load 10 [get_ports {RAM_DATA_WR[42]}]
set_load 10 [get_ports {RAM_DATA_WR[41]}]
set_load 10 [get_ports {RAM_DATA_WR[40]}]
set_load 10 [get_ports {RAM_DATA_WR[39]}]
set_load 10 [get_ports {RAM_DATA_WR[38]}]
set_load 10 [get_ports {RAM_DATA_WR[37]}]
set_load 10 [get_ports {RAM_DATA_WR[36]}]
set_load 10 [get_ports {RAM_DATA_WR[35]}]
set_load 10 [get_ports {RAM_DATA_WR[34]}]
set_load 10 [get_ports {RAM_DATA_WR[33]}]
set_load 10 [get_ports {RAM_DATA_WR[32]}]
set_load 10 [get_ports {RAM_DATA_WR[31]}]
set_load 10 [get_ports {RAM_DATA_WR[30]}]
set_load 10 [get_ports {RAM_DATA_WR[29]}]
set_load 10 [get_ports {RAM_DATA_WR[28]}]
set_load 10 [get_ports {RAM_DATA_WR[27]}]
set_load 10 [get_ports {RAM_DATA_WR[26]}]
set_load 10 [get_ports {RAM_DATA_WR[25]}]
set_load 10 [get_ports {RAM_DATA_WR[24]}]
set_load 10 [get_ports {RAM_DATA_WR[23]}]
set_load 10 [get_ports {RAM_DATA_WR[22]}]
set_load 10 [get_ports {RAM_DATA_WR[21]}]
set_load 10 [get_ports {RAM_DATA_WR[20]}]
set_load 10 [get_ports {RAM_DATA_WR[19]}]
set_load 10 [get_ports {RAM_DATA_WR[18]}]
set_load 10 [get_ports {RAM_DATA_WR[17]}]
set_load 10 [get_ports {RAM_DATA_WR[16]}]
set_load 10 [get_ports {RAM_DATA_WR[15]}]
set_load 10 [get_ports {RAM_DATA_WR[14]}]
set_load 10 [get_ports {RAM_DATA_WR[13]}]
set_load 10 [get_ports {RAM_DATA_WR[12]}]
set_load 10 [get_ports {RAM_DATA_WR[11]}]
set_load 10 [get_ports {RAM_DATA_WR[10]}]
set_load 10 [get_ports {RAM_DATA_WR[9]}]
set_load 10 [get_ports {RAM_DATA_WR[8]}]
set_load 10 [get_ports {RAM_DATA_WR[7]}]
set_load 10 [get_ports {RAM_DATA_WR[6]}]
set_load 10 [get_ports {RAM_DATA_WR[5]}]
set_load 10 [get_ports {RAM_DATA_WR[4]}]
set_load 10 [get_ports {RAM_DATA_WR[3]}]
set_load 10 [get_ports {RAM_DATA_WR[2]}]
set_load 10 [get_ports {RAM_DATA_WR[1]}]
set_load 10 [get_ports {RAM_DATA_WR[0]}]
set_load 10 [get_ports RAM_ENABLE_WR]
set_input_transition 0.1 [get_ports INT]
set_input_transition 0.1 [get_ports CLK]
set_input_transition 0.1 [get_ports RST]
set_input_transition 0.1 [get_ports Interpolate_DONE]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[63]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[62]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[61]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[60]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[59]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[58]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[57]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[56]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[55]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[54]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[53]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[52]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[51]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[50]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[49]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[48]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[47]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[46]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[45]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[44]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[43]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[42]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[41]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[40]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[39]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[38]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[37]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[36]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[35]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[34]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[33]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[32]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[31]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[30]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[29]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[28]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[27]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[26]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[25]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[24]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[23]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[22]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[21]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[20]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[19]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[18]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[17]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[16]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[15]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[14]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[13]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[12]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[11]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[10]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[9]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[8]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[7]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[6]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[5]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[4]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[3]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[2]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[1]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD1[0]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[63]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[62]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[61]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[60]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[59]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[58]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[57]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[56]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[55]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[54]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[53]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[52]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[51]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[50]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[49]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[48]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[47]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[46]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[45]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[44]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[43]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[42]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[41]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[40]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[39]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[38]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[37]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[36]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[35]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[34]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[33]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[32]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[31]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[30]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[29]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[28]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[27]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[26]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[25]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[24]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[23]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[22]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[21]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[20]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[19]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[18]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[17]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[16]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[15]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[14]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[13]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[12]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[11]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[10]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[9]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[8]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[7]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[6]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[5]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[4]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[3]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[2]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[1]}]
set_input_transition 0.1 [get_ports {RAM_DATA_RD2[0]}]
set_input_delay 0.7 [get_ports INT]
set_input_delay 0.7 [get_ports CLK]
set_input_delay 0.7 [get_ports RST]
set_input_delay 0.7 [get_ports Interpolate_DONE]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[63]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[62]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[61]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[60]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[59]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[58]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[57]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[56]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[55]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[54]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[53]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[52]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[51]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[50]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[49]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[48]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[47]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[46]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[45]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[44]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[43]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[42]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[41]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[40]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[39]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[38]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[37]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[36]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[35]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[34]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[33]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[32]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[31]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[30]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[29]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[28]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[27]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[26]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[25]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[24]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[23]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[22]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[21]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[20]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[19]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[18]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[17]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[16]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[15]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[14]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[13]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[12]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[11]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[10]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[9]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[8]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[7]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[6]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[5]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[4]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[3]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[2]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[1]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD1[0]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[63]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[62]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[61]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[60]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[59]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[58]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[57]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[56]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[55]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[54]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[53]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[52]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[51]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[50]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[49]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[48]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[47]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[46]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[45]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[44]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[43]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[42]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[41]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[40]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[39]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[38]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[37]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[36]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[35]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[34]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[33]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[32]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[31]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[30]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[29]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[28]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[27]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[26]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[25]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[24]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[23]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[22]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[21]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[20]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[19]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[18]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[17]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[16]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[15]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[14]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[13]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[12]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[11]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[10]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[9]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[8]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[7]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[6]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[5]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[4]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[3]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[2]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[1]}]
set_input_delay 0.7 [get_ports {RAM_DATA_RD2[0]}]
set_output_delay 0.3 -clock vsysclk [get_ports DONE]
set_output_delay 0.3 -clock vsysclk [get_ports Interpolate_Enable]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_RD1[12]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_RD1[11]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_RD1[10]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_RD1[9]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_RD1[8]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_RD1[7]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_RD1[6]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_RD1[5]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_RD1[4]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_RD1[3]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_RD1[2]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_RD1[1]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_RD1[0]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_RD2[12]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_RD2[11]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_RD2[10]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_RD2[9]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_RD2[8]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_RD2[7]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_RD2[6]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_RD2[5]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_RD2[4]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_RD2[3]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_RD2[2]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_RD2[1]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_RD2[0]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_WR[12]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_WR[11]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_WR[10]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_WR[9]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_WR[8]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_WR[7]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_WR[6]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_WR[5]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_WR[4]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_WR[3]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_WR[2]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_WR[1]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_ADD_WR[0]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[63]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[62]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[61]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[60]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[59]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[58]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[57]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[56]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[55]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[54]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[53]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[52]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[51]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[50]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[49]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[48]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[47]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[46]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[45]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[44]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[43]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[42]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[41]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[40]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[39]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[38]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[37]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[36]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[35]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[34]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[33]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[32]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[31]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[30]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[29]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[28]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[27]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[26]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[25]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[24]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[23]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[22]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[21]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[20]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[19]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[18]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[17]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[16]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[15]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[14]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[13]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[12]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[11]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[10]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[9]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[8]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[7]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[6]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[5]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[4]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[3]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[2]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[1]}]
set_output_delay 0.3 -clock vsysclk [get_ports {RAM_DATA_WR[0]}]
set_output_delay 0.3 -clock vsysclk [get_ports RAM_ENABLE_WR]
set_operating_conditions  -library  [get_libs {NangateOpenCellLibrary}] -max  typical
